https://stackoverflow.com/questions/54969074/python-3-remove-overlaps-in-table

In [2]:
import pandas as pd

id   hit from   to value
A   hit1    56  102 0.00085
B   hit2    89  275 0.00034
B   hit3    240 349 0.00034
C   hit4    332 480 3.40E-15
D   hit5    291 512 3.80E-24
D   hit6    287 313 0.00098
D   hit7    381 426 0.00098
D   hit8    287 316 0.0029
D   hit9    373 422 0.0029
D   hit10   514 600 0.0021

In [3]:
df = pd.read_clipboard()

In [14]:
df1 = df.copy()
df2 =  pd.DataFrame()
for i in df1.id.unique():                                                      # For loop for each id in the dataframe
    df_ = df1[df1['id']==i].sort_values(by='from').reset_index(drop = True)    # Generates a new dataframe with only the rows for each id sorted by from
    if len(df_) <= 1:                                                          # If the new dataframe is less or equals to one in lenght, it is NOT modified
        df_ = df_
    else:                        
        value = df_[0:1]['to'][0]
        df_ = df_[(df_['from'] > value)|(df_.index==0)]                        # For all other dataframes, it first check that all from values are less than the firsr value
        df_ = df_[df_['from']>df_['to'].shift(1)]  
    display (df_)# Remove all rows where the from value is less than the value in the to column previous row
    df2 = pd.concat([df2, df_], 0)                                             # Puts all the results for each id in the df2 dataframe
df2.reset_index(drop = True)

  id   hit  from   to    value
0  A  hit1    56  102  0.00085

Empty DataFrame
Columns: [id, hit, from, to, value]
Index: []

  id   hit  from   to         value
0  C  hit4   332  480  3.400000e-15

  id    hit  from   to   value
3  D   hit9   373  422  0.0029
5  D  hit10   514  600  0.0021

  id    hit  from   to         value
0  A   hit1    56  102  8.500000e-04
1  C   hit4   332  480  3.400000e-15
2  D   hit9   373  422  2.900000e-03
3  D  hit10   514  600  2.100000e-03

In [16]:
df[df.id =='D'].sort_values(by = 'from')

  id    hit  from   to         value
5  D   hit6   287  313  9.800000e-04
7  D   hit8   287  316  2.900000e-03
4  D   hit5   291  512  3.800000e-24
8  D   hit9   373  422  2.900000e-03
6  D   hit7   381  426  9.800000e-04
9  D  hit10   514  600  2.100000e-03

In [ ]:
df2.loc[:,'id_']=np.where(df2['id'] == df2['id'].shift(1), 1, 0)   
df2

In [ ]:
df2.loc[:,'drop_'] = np.where((df2['id'] == df2['id'].shift(1)) & ((df2['from'] < df2['to'].shift(1))), 1, 0)
df2

In [ ]:
df[0:1]['to']